{
  "_name_or_path": "sberbank-ai/sbert_large_nlu_ru",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "1": "LOWER_O",
    "2": "LOWER_PERIOD",
    "3": "LOWER_COMMA",
    "4": "LOWER_QUESTION",
    "5": "UPPER_O",
    "6": "UPPER_PERIOD",
    "7": "UPPER_COMMA",
    "8": "UPPER_QUESTION",
    "9": "UPPER_TOTAL_O",
    "10": "UPPER_TOTAL_PERIOD",
    "11": "UPPER_TOTAL_COMMA",
    "12": "UPPER_TOTAL_QUESTION",
    "-100": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "LOWER_O": 1,
    "LOWER_PERIOD": 2,
    "LOWER_COMMA": 3,
    "LOWER_QUESTION": 4,
    "UPPER_O": 5,
    "UPPER_PERIOD": 6,
    "UPPER_COMMA": 7,
    "UPPER_QUESTION": 8,
    "UPPER_TOTAL_O": 9,
    "UPPER_TOTAL_PERIOD": 10,
    "UPPER_TOTAL_COMMA": 11,
    "UPPER_TOTAL_QUESTION": 12,
    "O": -100
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "torch_dtype": "float16",
  "transformers_version": "4.20.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 120138
}
